Examples/ConservativeDBSPaper/DBS/microChannel_500_150_1/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top
    {
        type    fixedValue;
        value   uniform (0 0 0);
    }

    leftFace
    {
        type    zeroGradient;
    }

    rightFace
    {
        type    zeroGradient;
    }

    leftPorous
    {
        type    fixedValue;
        value   uniform (0 0 0);
    }

    rightPorous
    {
        type    fixedValue;
        value   uniform (0 0 0);
    }

    bottom
    {
        type    fixedValue;
        value   uniform (0 0 0);
    }

    frontAndBack
    {
        type    empty;
    }
}

// ************************************************************************* //
