Examples/ConservativeDBSPaper/DBS/microChannel_500_150_1/0_org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    leftFace
    {
        type    fixedValue;
        value   uniform PDROP;
    }

    rightFace
    {
        type    fixedValue;
        value   uniform 0;
    }

    leftPorous
    {
        type    fixedValue;
        value   uniform 0;
    }

    rightPorous
    {
        type    fixedValue;
        value   uniform 0;
    }

    bottom
    {
        type    zeroGradient;
    }

    top
    {
        type    zeroGradient;
    }

    frontAndBack
    {
        type    empty;
    }
}
// ************************************************************************* //
