Examples/ConservativeDBSPaper/DBS/microChannel_500_150_1/0_org/eps.org
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      eps.org;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    top
    {
        type           zeroGradient;
    }
    bottom
    {
        type           zeroGradient;
    }

    leftFace
    {
        type            zeroGradient;
    }

    rightFace
    {
        type            zeroGradient;
    }

    leftPorous
    {
	type            zeroGradient;
    }

    rightPorous
    {
        type            zeroGradient;
    }
 
    frontAndBack
    {
        type            empty;
    }
}



// ************************************************************************* //
