Examples/ConservativeDBSPaper/DBS/microChannel_500_150_1/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default steadyState;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss linear; //bounded Gauss upwind;
    div(phiEps,U)   Gauss linear; //bounded Gauss upwind; // Gauss limitedLinear 1.0; // bounded Gauss upwind;
    div(phiEps,T)   Gauss linear;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div(phiVOS,p)    Gauss linear;
    div(phi,T)      Gauss upwind; 
}

laplacianSchemes
{
    default         Gauss linear orthogonal; // Gauss linear uncorrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal; // uncorrected
}


// ************************************************************************* //
