Examples/ConservativeDBSPaper/DBS/microChannel_500_150_1/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

regions
(

    boxToCell
    {
        box (0 0 0) (8e-4 5e-5 5e-6);
        fieldValues
        (
            volScalarFieldValue eps 1e-9
        );
    }

    boxToCell
    {
        box (0 1e-4 0) (8e-4 1.5e-4 5e-6);
        fieldValues
        (
            volScalarFieldValue eps 1e-9
        );
    }

);


// ************************************************************************* //

